; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	thermograph1 - mode
	spectrograph2 - mode
	image0 - mode
	Star0 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation4 - direction
	Star5 - direction
	Star2 - direction
	GroundStation1 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 image0)
	(supports instrument2 spectrograph2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
)
(:goal (and
	(have_image Star8 spectrograph2)
	(have_image Phenomenon9 image0)
	(have_image Phenomenon10 image0)
	(have_image Star11 spectrograph2)
	(have_image Planet12 thermograph1)
	(have_image Star13 image0)
	(have_image Planet14 thermograph1)
	(have_image Planet15 image0)
))

)

; plan
1. (turn_to satellite1 groundstation1 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 8
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 8
3. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 8
4. (turn_to satellite1 planet12 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet12)
   goals met: 0 of 8
5. (take_image satellite1 planet12 instrument2 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 1 of 8
6. (turn_to satellite1 phenomenon9 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 8
7. (take_image satellite1 phenomenon9 instrument2 image0)
   added: (have_image phenomenon9 image0)
   goals met: 2 of 8
8. (turn_to satellite1 phenomenon10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 8
9. (take_image satellite1 phenomenon10 instrument2 image0)
   added: (have_image phenomenon10 image0)
   goals met: 3 of 8
10. (turn_to satellite1 planet14 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet14)
   goals met: 3 of 8
11. (take_image satellite1 planet14 instrument2 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 4 of 8
12. (turn_to satellite1 planet15 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet15)
   goals met: 4 of 8
13. (take_image satellite1 planet15 instrument2 image0)
   added: (have_image planet15 image0)
   goals met: 5 of 8
14. (turn_to satellite1 star11 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star11)
   goals met: 5 of 8
15. (take_image satellite1 star11 instrument2 spectrograph2)
   added: (have_image star11 spectrograph2)
   goals met: 6 of 8
16. (turn_to satellite1 star13 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star13)
   goals met: 6 of 8
17. (take_image satellite1 star13 instrument2 image0)
   added: (have_image star13 image0)
   goals met: 7 of 8
18. (turn_to satellite1 star8 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star8)
   goals met: 7 of 8
19. (take_image satellite1 star8 instrument2 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 8 of 8
